[
    {
        "stage": 1,
        "Noa": "האמת אתמול בערב ממש התבאסתי על דנה, קבענו להיפגש לקפה אתמול אחרי מלא זמן שלא נפגשנו. ממש קשה לי גם ככה לקבוע תוכניות ולצאת מהבית בתקופה הזו. חצי שעה לפני הזמן שקבענו, אחרי שכבר התארגנתי ובאתי לצאת היא כתבה לי שהיא ממש מצטערת אבל היא לא יכולה, בעלה היה בעבודה או משהו והיא הייתה צריכה לשמור על הילדים. לא משנה, זאת כבר הפעם השלישית שהיא עושה לי את זה. אני כבר לא יודעת מה לחשוב.. ",
        "correct_answer": "באמת לא נעים, תזכרי שקונפליקט הוא חלק מכל קשר שיש לנו.. איך את בדרך כלל מתנהגת במצבים כאלה?",
        "correct_answer_feedback": "תגובה זו מדגישה שקונפליקט הוא חלק בלתי נפרד מכל קשר בינאישי ובודקת כיצד נועה נוטה להתנהל במצבים אלו.",
        "incorrect_answer_1": "נשמע מבאס, ככה ברגע האחרון.. מה עשית בסוף?.",
        "incorrect_answer_1_feedback": "תגובה זו מתעניינת בחוויה של נועה אך אינה מתמקדת בקונפליקט שהיא מתארת מול דנה כחלק מפיתוח המיומנות של ניהול בריא של קונפליקטים. ",
        "incorrect_answer_2": "בואי ננסה לראות את הסיטואציה הזו מנקודת המבט של דנה, יכול להיות שלא הייתה לה כוונה לפגוע בך?",
        "incorrect_answer_2_feedback": "תגובה זו מתמקדת ביכולת של נועה להבין את נקודת המבט של דנה במקום להבין ולפתח את היכולת שלה להתנהל באופן אדפטיבי במצבי קונפליקט."
    },
    {
        "stage": 2,
        "Noa": "קשה לי בסיטואציות כאלה עם חברות, כשחברות מבריזות לי. לא אמרתי לה את זה, את יודעת איך זה.. אמרתי לה כאילו שהכל טוב וזה וזה סבבה אבל זה ממש לא מה שהרגשתי. ",
        "correct_answer": "נניח והיית אומרת לה משהו, מה היית רוצה להגיד? מה המטרה שלך בשיחה איתה?",
        "correct_answer_feedback": "תגובה זו מכווינה את נועה להבין את הצד שלה ואת המטרה שלה בשיחה פוטנציאלית עם דנה כחלק מפיתוח היכולת שלה לנהל קונפליקט בצורה בריאה. ",
        "incorrect_answer_1": "ממה שאת אומרת נשמע שאת נוטה לוותר על הצרכים והרצונות שלך בקשרים עם חברות.",
        "incorrect_answer_1_feedback": "תגובה זו משקפת את דפוס היחסים הבינאישיים של נועה אך אינה מסייעת לה לפתח את המיומנות של ניהול בריא של קונפליקטים. ",
        "incorrect_answer_2": "מה לדעתך גורם לך להגיב ככה בסיטואציות כאלה?",
        "incorrect_answer_2_feedback": "תגובה זו מתייחסת להבנת הגורמים להתנהגות של נועה במצבים מהסוג שהיא מתארת ולא ליכולת לנהל קונפליקט בצורה בריאה. "
    },
    {
        "stage": 3,
        "Noa": "הייתי רוצה שהיא פשוט לא תעשה את זה שוב, או שאם היא עושה את זה שתבין שזה מבאס ותקח אחריות. כאילו לא בא לי לריב איתה, בגלל זה גם לא אמרתי לה כלום, אבל נניח והיינו עושות שיחה הייתי רוצה להגיד לה את הצד שלי מה אני מרגישה ולבקש שזה לא יקרה שוב ככה, אלא עם יותר רגישות למה זה עשה לי שהיא ביטלה ברגע האחרון.",
        "correct_answer": "זה מאתגר עבורך אבל חשוב שתגידי מה הרגשת ומה את מצפה. בואי נתרגל, איך את יכולה להגיד לה את זה? ",
        "correct_answer_feedback": "תגובה זו מעודדת תרגול ממשי בו נועה יכולה להגיד את הרגשות והציפיות הקונקרטיות שלה מדנה כחלק מניהול הקונפליקט. ",
        "incorrect_answer_1": "כמה שזה מבאס לא בטוח שהיא יכולה להבטיח שזה לא יקרה. בואי ננסה לחשוב מי בסביבה שלך יכול לעזור לך להתמודד עם סיטואציה כזו?",
        "incorrect_answer_1_feedback": "תגובה זו מעודדת את נועה לפנות לעזרה ותמיכה מהסביבה הקרובה שלה ולא מתמקדת בפיתוח היכולת שלה לנהל באופן בריא את הקונפליקט אותו היא מתארת. ",
        "incorrect_answer_2": "אולי כרגע פחות מתאים לך להיכנס לקונפליקטים ועדיף לקחת מרחק מאנשים וממצבים שמובילים אותך למצבים כאלה. ",
        "incorrect_answer_2_feedback": "תגובה זו מעודדת את נועה להימנע מאנשים ומצבים שמקשים עליה במקום לסייע לה בפיתוח המיומנות לניהול קונפליקטים באופן אדפטיבי."
    },
    {
        "stage": 4,
        "Noa": "אני יכולה להגיד לה- ״תקשיבי דנה, מה שקרה אתמול ממש ביאס אותי, כבר מלא זמן לא נפגשנו וזאת לא פעם ראשונה שזה קורה ושאת מבטלת לי ברגע האחרון בלי רגישות למה זה עושה לי. כבר ממש באתי לצאת, וזה הרגיש שאת ממש לא רואה כמה זה ביאס אותי״.",
        "correct_answer": "נניח והיא תענה- ״יש עליי הרבה עומס בתקופה הזאת וזה ממש לא היה בשליטתי״. מה תגידי?",
        "correct_answer_feedback": "תגובה זו מבטאת תגובה אפשרית של דנה ומציעה לנועה להמשיך לתרגל בפועל את היכולת שלה להתנהל באופן אדפטיבי במצבי קונפליקט.",
        "incorrect_answer_1": "איך החברות שלכן בתקופה האחרונה? יכול להיות שלקשר הזה יש משמעות שונה מבעבר בתקופה הזו?",
        "incorrect_answer_1_feedback": "תגובה זו מנסה להבין יותר את מאפייני הקשר הבינאישי של נועה ודנה ואינה מסייעת לה בפיתוח המיומנות לניהול בריא של קונפליקטים.",
        "incorrect_answer_2": "מעניין איך היא תגיב, אמרת שבדרך כלל את לא אומרת לדנה בצורה ישירה מה את מרגישה.",
        "incorrect_answer_2_feedback": "תגובה זו מביעה סקרנות כלפי התגובה של דנה מבלי לסייע לנועה לתרגל באופן ממשי דיאלוג אפשרי ביניהן."
    },
    {
        "stage": 5,
        "Noa": "זה יהיה מרגיע לשמוע שזה לא קשור אליי אלא שהיא באמת עמוסה. אולי אני אוכל לבקש ממנה פשוט שתשתדל לעדכן אותי לפני, או שאם היא יודעת מראש שיש סיכוי שברגע האחרון היא תצטרך לבטל שתכין אותי מראש. ואם זה לא ידוע מראש שרק תהיה יותר עם רגישות ותיקח אחריות.",
        "correct_answer": "ההצעה שלך נשמעת כמו פשרה טובה שאפשר להציע לפעם הבאה.",
        "correct_answer_feedback": "תגובה זו מעודדת את נועה למצוא פשרה ולנהל עם דנה משא ומתן כחלק מחיזוק היכולת שלה להתנהל באופן מיטבי במצבי קונפליקט.",
        "incorrect_answer_1": "הכי חשוב שאמרת מה את מרגישה, עכשיו זה באמת כבר בידיים של דנה. ",
        "incorrect_answer_1_feedback": "תגובה זו מדגישה את חוסר השליטה של נועה על תגובתה של דנה ואינה מתייחסת לאפשרות של מציאת פשרה כחלק מהתהליך של ניהול הקונפליקט.",
        "incorrect_answer_2": "איך את חושבת שתגיבי במידה ומה שתגידי לדנה לא יעזור?",
        "incorrect_answer_2_feedback": "תגובה זו מנסה להבין כיצד נועה תגיב במצב בו השיחה לא תתנהל כפי שתכננה ולא מתייחסת לתהליך של ניהול בריא של קונפליקטים. "
    },
    {
        "stage": 6,
        "Noa": "אני מקווה שזה יעזור. החברות עם דנה חשובה לי. אני לא אוהבת כל כך סיטואציות כאלה של קונפליקט אבל כנראה שלפעמים זה באמת בלתי נמנע… "
    }
]